app/views/OWS/Availability/FetchAvailablePackages.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:ava="http://webservices.micros.com/ows/5.1/Availability.wsdl" xmlns:hot="http://webservices.micros.com/og/4.3/HotelCommon/" xmlns:ava1="http://webservices.micros.com/og/4.3/Availability/">
   <soapenv:Header>
      <core:OGHeader transactionID="{transactionID}" primaryLangID="E" timeStamp="{timeStamp}" xmlns="http://webservices.micros.com/og/4.3/Core/">
         <core:Origin entityID="{hotelCode}" systemType="WEB"/>
         <core:Destination entityID="{hotelCode}" systemType="PMS"/>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <ava:FetchAvailablePackagesRequest>
         <ava:HotelReference chainCode="{chainCode}" hotelCode="{hotelCode}"></ava:HotelReference>
         <ava:StayDateRange>
            <hot:StartDate>2011-09-06T00:00:00.0000000-05:00</hot:StartDate>
            <hot:EndDate>2011-12-07T00:00:00.0000000-05:00</hot:EndDate>
		</ava:StayDateRange>
      </ava:FetchAvailablePackagesRequest>
   </soapenv:Body>
</soapenv:Envelope>